---
kind: type
id: T:Autodesk.Revit.DB.FilterNumericGreaterOrEqual
source: html/c77b5955-2ca2-16aa-4567-5a4470e24289.htm
---
# Autodesk.Revit.DB.FilterNumericGreaterOrEqual

Tests whether numeric values from the document are greater than or equal to a certain value

## Syntax (C#)
```csharp
public class FilterNumericGreaterOrEqual : FilterNumericRuleEvaluator
```